"ArrayChronologies": [
        {
            "PPO": "8761863",
            "Chronology": [
                {
                    "TypeOperation": "Доставка",
                    "statuses": [
                        "Доставляется до клиента (на складе отгрузки)",
                        "Доставляется"
                    ]
                },
                {
                    "TypeOperation": "Самовывоз",
                    "statuses": [
                        "Ожидает клиента",
                        "Доставляется",
                        "Оформлен",
                        "Сделка завершена"
                    ]
                }
            ]
        }
    ]

