API для разработчиков
Данный компонент предназначен для интеграции продукта Gelios с другими информационными системами.

Запрос в общем виде выглядит следующим образом:

admin.geliospro.com/sdk/?login=demo&pass=demo&svc=get_units&params={}
Вместо пары логин и пароль также можно использовать токен:

admin.geliospro.com/sdk/?token=111222111222111222111222&svc=get_units&params={}
Все запросы на изменение данных требуют прав администратора и прав на редактирование сущности.

Компонент включает в себя следующие группы запросов:

Авторизация
Пользователи
Права
Объекты
Датчики
Команды
Отчеты
Геообъекты
Уведомления
Маршруты
Ретрансляторы
Статистика
Локатор
—- Коды ошибок
